<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest version of Freeway Express.

SoftPress, the developers of Freeway Express, announced in July 2016 that they are closing down. Therefore, this recipe is deprecated and will be removed eventually.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.install.FreewayExpress</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FreewayExpress</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.FreewayExpress</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
